<!-- src/routes/company/+page.svelte -->
<script lang="ts">
  import { onMount } from 'svelte'
  import { t, Language } from '$lib/locales/i18n'

  /**
   * Подписка на изменения в UserStore и Language
   */
  let currentLang: string | undefined = $state()
  onMount(() => {
    /* Подписка на изменение языка */
    const unsubscribeLanguage = Language.subscribe((value) => {
      currentLang = value
    })

    /* Функция для очистки подписок */
    return () => {
      unsubscribeLanguage()
    }
  })
</script>

<div class="flex h-full w-full flex-col items-stretch overflow-auto">
  {#if currentLang}
    <h2 class="mb-4 text-2xl font-bold">{t('company.title', currentLang)}</h2>
  {/if}
  <div class="w-full p-8 text-justify">
    <p class="mb-4">
      Облачный ресурс, разработанный компанией ОАО "Пеленг", представляет собой современное решение для централизованного ведения и хранения
      информации о модулях и изделиях. В условиях быстро меняющегося технологического мира, где информация является ключевым активом, данный ресурс
      предлагает уникальные возможности для разработчиков, обеспечивая высокий уровень удобства и безопасности.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Назначение облачного ресурса</h4>
    <p class="mb-4">
      Главной целью облачного ресурса ОАО "Пеленг" является создание единой платформы для хранения и управления данными о всех модулях и изделиях
      компании.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Централизованное ведение и хранение каталога</h4>
    <p class="mb-4">
      Облачный ресурс позволяет централизованно вести и хранить каталог всех модулей и изделий компании. Это означает, что инженеры могут легко
      находить и получать доступ к необходимой информации, не теряя времени на поиск в различных источниках. Удобный интерфейс и структурированная
      база данных обеспечивают интуитивно понятный доступ к информации, что значительно улучшает производительность работников.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Хранилище последних версий прошивок</h4>
    <p class="mb-4">
      Важной особенностью облачного ресурса является возможность хранения последних версий прошивок в формате BIN. Это позволяет сотрудникам всегда
      иметь доступ к актуальным обновлениям, что критически важно для обеспечения стабильной работы оборудования. Система уведомлений о новых версиях
      прошивок помогает не пропускать важные обновления, что также способствует поддержанию высокой эффективности работы.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Документация в формате PDF</h4>
    <p class="mb-4">
      Кроме хранения прошивок, облачный ресурс обеспечивает доступ к документации по всем модулям и изделиям в формате PDF. Это облегчает процесс
      ознакомления с продуктами и их характеристиками. Разработчики могут загружать, просматривать и делиться документами, что особенно полезно для
      сотрудников, работающих в разных подразделениях компании. Наличие актуальной документации также уменьшает вероятность ошибок при эксплуатации
      оборудования.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Личный кабинет с учетом уровня доступа</h4>
    <p class="mb-4">
      Облачный ресурс реализует функционал личного кабинета, который позволяет учитывать уровень доступа пользователя. Это важный аспект безопасности,
      так как разные категории пользователей могут иметь различные права и возможности в системе. Такой подход не только защищает данные, но и
      упрощает процесс работы, позволяя пользователям сосредоточиться на своих задачах, не отвлекаясь на информацию, которая им не нужна.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Удаленное управление и обслуживание изделий</h4>
    <p class="mb-4">
      Одной из ключевых возможностей облачного ресурса является удаленное управление и обслуживание изделий. При наличии шлюза и подключения к
      интернету специолисты могут управлять своими устройствами из любой точки мира. Это открывает новые горизонты для обслуживания и мониторинга
      оборудования, позволяя быстро реагировать на возникающие проблемы и минимизировать время простоя.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Внутренний чат для обмена сообщениями</h4>
    <p class="mb-4">
      Облачный ресурс включает реализацию внутреннего чата для обмена служебными сообщениями по защищенному каналу с шифрованием. Это обеспечивает
      безопасность и конфиденциальность общения между сотрудниками. Чат позволяет быстро обмениваться информацией, обсуждать текущие задачи и решать
      вопросы, не прибегая к сторонним мессенджерам, что повышает общую эффективность коммуникации внутри компании.
    </p>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Преимущества для разработчиков</h4>
    <ul class="mb-4 list-inside list-disc">
      <li>Удобный доступ к информации: Все данные собраны в одном месте, что позволяет легко находить необходимую информацию.</li>
      <li>Актуальность данных: Пользователи всегда имеют доступ к последним версиям прошивок и документации.</li>
      <li>Безопасность: Механизмы управления доступом и шифрования сообщений защищают данные и обеспечивают конфиденциальность.</li>
      <li>Поддержка удаленного управления: Возможность управления изделиями из любой точки мира значительно упрощает процесс обслуживания.</li>
    </ul>

    <h4 class="mt-6 mb-2 text-lg font-semibold">Заключение</h4>
    <p>
      Облачный ресурс ОАО "Пеленг" является важным шагом в направлении цифровизации и оптимизации управления данными. Он предоставляет пользователям
      необходимые инструменты для эффективной работы, помогает снизить риски и повысить уровень обслуживания. Внедрение таких технологий не только
      улучшает внутренние процессы, но и создает конкурентное преимущество на рынке. ОАО "Пеленг" уверенно движется к будущему, предлагая своим
      клиентам самые современные решения для управления информацией.
    </p>
  </div>
</div>
